app/controllers/items_controller.rb

  def index
    if params[:tag]
      @items = Item.find_tagged_with(params[:tag])
    else
      @items = Item.all
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_type = 'Item') AND ("taggings".taggable_id = 1))
SELECT * FROM "items" WHERE (user_id = 1)
SELECT * FROM "items"

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 2)

  def create
    @item = Item.new(params[:item])
    @item.done = false

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("updated_at", "title", "done", "user_id", "created_at") VALUES('2009-05-16 23:18:33', 'はしご下の寸法を測る', 'f', 1, '2009-05-16 23:18:33')

  def update
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)